---
kind: property
id: P:Autodesk.Revit.DB.FillPattern.IsSolidFill
source: html/91cf0879-d401-4f6b-c26b-6b3ece4200db.htm
---
# Autodesk.Revit.DB.FillPattern.IsSolidFill Property

Check if the fill pattern is a solid fill pattern.

## Syntax (C#)
```csharp
public bool IsSolidFill { get; }
```